Revit 2027 API
NumberingSchema.GetPartitioningParameters Method
 Get the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<NumberingParameter> GetPartitioningParameters()
Public Function GetPartitioningParameters As ICollection(Of NumberingParameter)
public:
ICollection<NumberingParameter^>^ GetPartitioningParameters()
member GetPartitioningParameters : unit -> ICollection<NumberingParameter>
Return Value
ICollection<NumberingParameter>
 Returns the set of parameters used to partition elements within the numbering schema.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace